Tekla.Structures.DirectManipulation.Adapter.EventRegistry.SelectorEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.SelectorEvents class contains the identifiers for selector events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.SelectorEvents.SelectionChanged
Expected identification string for selection changed events.